app/controllers/api/v1/authentication_controller.rb

  def create
    user_password = params[:password]
    user_email = params[:email]
    user = user_email.present? && User.find_by(email: user_email)
    puts user
    if user
      if user.valid_password? user_password
        # sign_in user, store: false
        if !user.token
          user.generate_authentication_token!
          user.save
        end

        us = MeSerializer.new(User.find(user.id))
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "albert@gmail.com"]]
UPDATE "users" SET "token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["token", "puXbBDyggmjLsTvVskdv"], ["updated_at", "2016-02-21 03:17:03.202080"], ["id", 25]]
SELECT  "users".* FROM "users" WHERE "users"."token" IS NULL LIMIT 1