app/controllers/api/v1/categories_controller.rb

  def index
    render json: Category.all.includes(:sub_categories), status: :ok
---
SELECT "sub_categories".* FROM "sub_categories" WHERE "sub_categories"."category_id" = $1  [["category_id", 1]]