app/controllers/api/v1/services_controller.rb

SELECT "services".* FROM "services"  ORDER BY "services"."updated_at" DESC
---
  def index

    services = Service.search(params)

SELECT  "services".* FROM "services" WHERE "services"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    ser = Service.find(params[:id])

INSERT INTO "services" ("name", "description", "category_id", "country", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "sdsdsd"], ["description", "sdsds"], ["category_id", 2], ["country", ""], ["price", "34343.0"], ["created_at", "2016-03-07 08:03:59.374263"], ["updated_at", "2016-03-07 08:03:59.374263"]]
---
  def create
    ser = Service.new(service_params)
    if ser.save

SELECT  "services".* FROM "services" WHERE "services"."id" = $1 LIMIT 1  [["id", 0]]
UPDATE "services" SET "name" = $1, "description" = $2, "price" = $3, "updated_at" = $4 WHERE "services"."id" = $5  [["name", "8 horas de limpieza en hogar3"], ["description", "8 horas de limpieza domestica....3"], ["price", "333.0"], ["updated_at", "2016-03-09 05:58:53.074298"], ["id", 57]]
---
  def update
    service = Service.find(params[:id])

    if service.update(service_params)

SELECT  "services".* FROM "services" WHERE "services"."id" = $1 LIMIT 1  [["id", 101]]
UPDATE "services" SET "published" = $1, "updated_at" = $2 WHERE "services"."id" = $3  [["published", "f"], ["updated_at", "2016-03-11 22:28:22.355179"], ["id", 101]]
---
  def published
    service = Service.find(params[:id])
    # puts service_params[:publish]
    if service.update_attribute(:published, params[:publish])

SELECT  "services".* FROM "services" WHERE "services"."id" = $1 LIMIT 1  [["id", 64]]
DELETE FROM "services" WHERE "services"."id" = $1  [["id", 64]]
---
  def destroy
    service = Service.find(params[:id])
    service.destroy