app/controllers/api/v1/services_controller.rb

  def show
    ser = Service.includes(:sub_category, :unit_type).find_by(id: params[:id], isActive: true, published: true)
---
SELECT  "sub_categories".* FROM "sub_categories" WHERE "sub_categories"."id" = $1 LIMIT 1  [["id", 11]]