app/controllers/api/v1/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    render json: User.all, status: :ok

INSERT INTO "users" ("first_name", "last_name", "email", "encrypted_password", "birthdate", "cellphone", "description", "avatar", "created_at", "updated_at", "token") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
SELECT  1 AS one FROM "users" WHERE "users"."email" = 'oscar.graciae@gmail.com' LIMIT 1
---
 def create
   user = User.new(user_params)
   if user.save
	    render json: user, status: 201
	  else

      msj = ""
      msj += user.errors[:email].any? ? "Esa dirección de correo electrónico ya está en uso. " : " "

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 9]]
UPDATE "users" SET "email" = $1, "encrypted_password" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["email", "pruebas5@gmail.com"], ["encrypted_password", "$2a$10$PQjV8bRkizOuBTd.q1h7VujUrZ0yO9WUXVoI26xzoa3XlwGkn80G."], ["updated_at", "2016-02-20 23:08:01.388783"], ["id", 9]]
---
 def update
   # user = @user
   user = User.find(params[:id])
   if user.update(user_params)